#### Terraform Plan 📋 `stage/argocd`

**Summary:** 11:50:35.412 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.

<details><summary>Show Plan Details</summary>

```terraform
11:50:35.410 STDOUT terraform:                   tolerations:
11:50:35.410 STDOUT terraform:                     - key: "service"
11:50:35.410 STDOUT terraform:                       operator: "Equal"
11:50:35.410 STDOUT terraform:                       value: "monitoring"
11:50:35.410 STDOUT terraform:                       effect: "NoSchedule"
11:50:35.410 STDOUT terraform:                   nodeSelector:
11:50:35.410 STDOUT terraform:                     service: monitoring
11:50:35.410 STDOUT terraform:                 
11:50:35.410 STDOUT terraform:                 server:
11:50:35.410 STDOUT terraform:                   service:
11:50:35.410 STDOUT terraform:                     type: LoadBalancer
11:50:35.410 STDOUT terraform:                     annotations:
11:50:35.410 STDOUT terraform:                       service.beta.kubernetes.io/do-loadbalancer-name: "argocd-stage"
11:50:35.410 STDOUT terraform:                     loadBalancerSourceRanges:
11:50:35.410 STDOUT terraform:                       - "PLACEHOLDER/32"
11:50:35.410 STDOUT terraform:                   resources:
11:50:35.410 STDOUT terraform:                     requests:
11:50:35.410 STDOUT terraform:                       cpu: 100m
11:50:35.410 STDOUT terraform:                       memory: 128Mi
11:50:35.410 STDOUT terraform:                     limits:
11:50:35.410 STDOUT terraform:                       cpu: 200m
11:50:35.410 STDOUT terraform:                       memory: 256Mi
11:50:35.410 STDOUT terraform:                 
11:50:35.410 STDOUT terraform:                 controller:
11:50:35.410 STDOUT terraform:                   resources:
11:50:35.410 STDOUT terraform:                     requests:
11:50:35.410 STDOUT terraform:                       cpu: 250m
11:50:35.410 STDOUT terraform:                       memory: 512Mi
11:50:35.410 STDOUT terraform:                     limits:
11:50:35.410 STDOUT terraform:                       cpu: 500m
11:50:35.410 STDOUT terraform:                       memory: 1Gi
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 repoServer:
11:50:35.411 STDOUT terraform:                   resources:
11:50:35.411 STDOUT terraform:                     requests:
11:50:35.411 STDOUT terraform:                       cpu: 100m
11:50:35.411 STDOUT terraform:                       memory: 256Mi
11:50:35.411 STDOUT terraform:                     limits:
11:50:35.411 STDOUT terraform:                       cpu: 200m
11:50:35.411 STDOUT terraform:                       memory: 512Mi
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 redis:
11:50:35.411 STDOUT terraform:                   resources:
11:50:35.411 STDOUT terraform:                     requests:
11:50:35.411 STDOUT terraform:                       cpu: 50m
11:50:35.411 STDOUT terraform:                       memory: 64Mi
11:50:35.411 STDOUT terraform:                     limits:
11:50:35.411 STDOUT terraform:                       cpu: 100m
11:50:35.411 STDOUT terraform:                       memory: 128Mi
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 dex:
11:50:35.411 STDOUT terraform:                   enabled: false
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 notifications:
11:50:35.411 STDOUT terraform:                   enabled: false
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 applicationSet:
11:50:35.411 STDOUT terraform:                   resources:
11:50:35.411 STDOUT terraform:                     requests:
11:50:35.411 STDOUT terraform:                       cpu: 50m
11:50:35.411 STDOUT terraform:                       memory: 64Mi
11:50:35.411 STDOUT terraform:                     limits:
11:50:35.411 STDOUT terraform:                       cpu: 100m
11:50:35.411 STDOUT terraform:                       memory: 128Mi
11:50:35.411 STDOUT terraform:                 
11:50:35.411 STDOUT terraform:                 configs:
11:50:35.411 STDOUT terraform:                   params:
11:50:35.411 STDOUT terraform:                     server.insecure: "false"
11:50:35.411 STDOUT terraform:                   cm:
11:50:35.411 STDOUT terraform:                     admin.enabled: "false"
11:50:35.411 STDOUT terraform:             EOT,
11:50:35.411 STDOUT terraform:         ]
11:50:35.411 STDOUT terraform:       + verify                     = false
11:50:35.411 STDOUT terraform:       + version                    = "7.8.13"
11:50:35.411 STDOUT terraform:       + wait                       = true
11:50:35.411 STDOUT terraform:       + wait_for_jobs              = false
11:50:35.411 STDOUT terraform:     }
11:50:35.411 STDOUT terraform:   # kubernetes_namespace_v1.argocd will be created
11:50:35.411 STDOUT terraform:   + resource "kubernetes_namespace_v1" "argocd" {
11:50:35.411 STDOUT terraform:       + id                               = (known after apply)
11:50:35.411 STDOUT terraform:       + wait_for_default_service_account = false
11:50:35.411 STDOUT terraform:       + metadata {
11:50:35.411 STDOUT terraform:           + generation       = (known after apply)
11:50:35.411 STDOUT terraform:           + labels           = {
11:50:35.411 STDOUT terraform:               + "name" = "argocd"
11:50:35.411 STDOUT terraform:             }
11:50:35.411 STDOUT terraform:           + name             = "argocd"
11:50:35.412 STDOUT terraform:           + resource_version = (known after apply)
11:50:35.412 STDOUT terraform:           + uid              = (known after apply)
11:50:35.412 STDOUT terraform:         }
11:50:35.412 STDOUT terraform:     }
11:50:35.412 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
11:50:35.412 STDOUT terraform: Changes to Outputs:
11:50:35.412 STDOUT terraform:   + helm_release_name   = "argocd"
11:50:35.412 STDOUT terraform:   + helm_release_status = "deployed"
11:50:35.412 STDOUT terraform:   + namespace           = "argocd"
11:50:35.466 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
11:50:35.466 STDOUT terraform: Saved the plan to: tfplan
11:50:35.466 STDOUT terraform: To perform exactly these actions, run the following command to apply:
11:50:35.466 STDOUT terraform:     terraform apply "tfplan"
```

</details>

*Pusher: @krukmaksym, Action: `pull_request`, Workflow: `Terraform PR Validation`*